SOAP/resources/catalog/Echo_String_Envelope.xml

<?xml version="1.0" encoding="utf-8"?>
<!--SOAP envelope consumed by the service at https://eaglesoa.com/services-1.0/Test.asmx.
It calls the method Echo to output the input string-->
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
      xmlns:xsd="http://www.w3.org/2001/XMLSchema"
      xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Echo xmlns="http://activant.com/Services">
      <s xmlns="http://activant.com/Services">?</s>
    </Echo>
  </soap:Body>
</soap:Envelope>